function [r, g, b] = func_1_4(matrix, n, m)
% R, G, B функция
if mod(m, 2) ~= 0 || m <= 1 || n <= 1 % Проверка на разложимость. Будем считать также некорректным разложение, где хотя бы одна из матриц пуста.
    error("Разложение невозможно!");
end
b = matrix(2:2:n, 1:2:m); % Получение B
r = matrix(1:2:n, 2:2:m); % Получение R
g_odd = horzcat((1:2:n)', matrix(1:2:n, 1:2:m)); % Нумеруем нечётные строки из G
g_even = horzcat((2:2:n)', matrix(2:2:n, 2:2:m)); % Нумеруем чётные строки из G
g = sortrows(vertcat(g_odd, g_even)); %Получаем G с номерами строк
g = g(:, 2:1:m/2 + 1); % Избавляемся от номеров строк
end