function [dots, res] = rectangles(a, b, n, m, f)
% Вычисление интеграла функции методом прямоугольников
% a - левый конец отрезка
% b - правый конец отрезка
% n - количество точек разбиения (число)
% m = количество точек в разбиении подотрезка для вычисления интеграла на нём
% f - заданная функция одной переменной

dots = linspace(a, b, n + 1); % Разбиение отрезка на n равных частей
x = repmat(dots(1:n), m, 1); % Матрица левых концов отрезков разбиения
h_0 = (b - a) / (n * m); % Размер шага
h = repmat(h_0, m, n) .* (1:m)'; % Матрица шагов
res = horzcat(0, sum(triu((repmat(sum(h_0 * f(x + h), 1), n, 1)')), 1)); % Без комментариев, см записи на бумаге
end