function [dots, res] = simpson(a, b, n, m, f)
% Вычисление интеграла функции методом Симпсона
% a - левый конец отрезка
% b - правый конец отрезка
% n - количество точек разбиения (число)
% m = количество точек в разбиении подотрезка для вычисления интеграла на нём
% f - заданная функция одной переменной

dots = linspace(a, b, n + 1); % Разбиение отрезка на n равных частей
x = repmat(dots(1:n), m, 1); % Матрица левых концов отрезков разбиения
h_0 = (b - a) / (n * m); % Размер шага
h = repmat(h_0, m, n) .* (1:m)'; % Вспомогательная матрица шагов (правые концы отрезков)
h_1 = h - h_0; % Вспомогательная матрица шагов (левые концы отрезков)
h_2 = h - (h_0 / 2); % Вспомогательная матрица шагов (середины отрезков)
res = horzcat(0, sum(triu(repmat(sum((h_0 / 6) * (f(x + h_1) + 4 * f(x + h_2) + f(x + h)), 1), n, 1)'), 1)); % Без комментариев, см записи на бумаге
end